app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'julalfpacis12@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
INSERT INTO `password_resets` (`email`, `token`, `expires_at`, `created_at`) VALUES ('julalfpacis12@gmail.com', '52d821407729fa2084454ef4e1ca69900e76a791d9d238b608dcab9b812213c3', '2026-05-01 18:48:07', '2026-05-01 17:48:07')
---
    public function sendResetLink(): RedirectResponse
    {
        $email   = trim((string) service('request')->getPost('email'));
        $session = session();

        if ($email === '') {
            return redirect()->back()->withInput()->with('error', 'Email is required.');
        }

        $user = $this->users->where('email', $email)->first();

        if (! $user) {
            return redirect()->back()->withInput()->with('error', 'If that email exists, a reset link has been sent.');
        }

        $token   = bin2hex(random_bytes(32));
        $expires = date('Y-m-d H:i:s', time() + 3600);

        $db = db_connect();
        $db->table('password_resets')->insert([
            'email'      => $email,
            'token'      => $token,
            'expires_at' => $expires,
            'created_at' => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `password_resets`
WHERE `token` = '52d821407729fa2084454ef4e1ca69900e76a791d9d238b608dcab9b812213c3'
---
    public function showResetForm(string $token): string|ResponseInterface
    {
        $db  = db_connect();
        $row = $db->table('password_resets')->where('token', $token)->get()->getRowArray();

SELECT *
FROM `password_resets`
WHERE `token` = '52d821407729fa2084454ef4e1ca69900e76a791d9d238b608dcab9b812213c3'
UPDATE `users` SET `password_hash` = '$2y$10$7.JTcky/9kbg.FSv.hWDhurYEIjcckM7.9pWDLVEFmW45l2axFtbO', `failed_attempts` = 0, `last_failed_at` = NULL, `updated_at` = '2026-05-01 17:49:36'
WHERE `email` = 'julalfpacis12@gmail.com'
DELETE FROM `password_resets`
WHERE `email` = 'julalfpacis12@gmail.com'
---
    public function resetPassword(string $token): RedirectResponse
    {
        $request = service('request');
        $db      = db_connect();

        $row = $db->table('password_resets')->where('token', $token)->get()->getRowArray();

        if (! $row || $row['expires_at'] < date('Y-m-d H:i:s')) {
            return redirect()->to('/')->with('error', 'Reset link is invalid or expired.');
        }

        $password        = (string) $request->getPost('password');
        $passwordConfirm = (string) $request->getPost('password_confirm');

        if ($password === '' || $passwordConfirm === '') {
            return redirect()->back()->withInput()->with('error', 'Both password fields are required.');
        }

        if ($password !== $passwordConfirm) {
            return redirect()->back()->withInput()->with('error', 'Passwords do not match.');
        }

        $hash = password_hash($password, PASSWORD_DEFAULT);

        $this->users->where('email', $row['email'])->set([
            'password_hash'   => $hash,
            'failed_attempts' => 0,
            'last_failed_at'  => null,
        ])->update();

        $db->table('password_resets')->where('email', $row['email'])->delete();