app/Controllers/Chat.php

    public function getTypingApi(): ResponseInterface
    {
        $toUserId = (int) ($this->request->getGet('to') ?? session()->get('user_id'));
        if ($toUserId < 1) {
            return $this->response->setStatusCode(401)->setJSON(['typing' => false]);
        }

        $fromUserId = (int) $this->request->getGet('with');
        if ($fromUserId < 1 || $fromUserId === $toUserId) {
            return $this->response->setJSON(['typing' => false]);
        }

        $typingTimeoutSeconds = 6;
        $threshold = date('Y-m-d H:i:s', time() - $typingTimeoutSeconds);
        $db        = \Config\Database::connect();

        try {
            $row = $db->table('typing_indicators')
                ->select('is_typing, updated_at')
                ->where('from_user_id', $fromUserId)
                ->where('to_user_id', $toUserId)
                ->get()
                ->getRowArray();
---
SELECT `is_typing`, `updated_at`
FROM `typing_indicators`
WHERE `from_user_id` = 6
AND `to_user_id` = 2

    private function getChatUserList(int $currentUserId): array
    {
        $now            = time();
        $timeoutSeconds = (int) config('App')->presenceTimeoutSeconds;
        $hasPresenceColumns = $this->usersHasPresenceColumns();
        $typingTimeoutSeconds = 6;
        $typingByFromUserId = $this->getTypingByFromUserIds($currentUserId, $typingTimeoutSeconds);

        $select = $hasPresenceColumns
            ? 'id, name, username, role, is_online, last_seen_at'
            : 'id, name, username, role';

        $users = $this->users
            ->select($select)
            ->orderBy('name')
            ->findAll();
        $partnerIds = $this->messages->getConversationPartnerIds($currentUserId);

        // Unread counts per sender (messages sent TO current user that are not READ yet).
        $unreadRows = $this->messages
            ->select('sender_id, COUNT(*) AS unread_count')
            ->where('receiver_id', $currentUserId)
            ->where('status !=', 'READ')
            ->groupBy('sender_id')
            ->findAll();
---
SELECT `sender_id`, COUNT(*) AS unread_count
FROM `messages`
WHERE `receiver_id` = 6
AND `status` != 'READ'
AND `messages`.`deleted_at` IS NULL
GROUP BY `sender_id`

    private function getTypingByFromUserIds(int $toUserId, int $timeoutSeconds): array
    {
        static $cachedToUserId = null;
        static $cachedTimeoutSeconds = null;
        static $cached = [];

        // Cache per request for the "chat sidebar" list so we don't re-query per user.
        if ($cachedToUserId === $toUserId && $cachedTimeoutSeconds === $timeoutSeconds) {
            return $cached;
        }

        $cachedToUserId = $toUserId;
        $cachedTimeoutSeconds = $timeoutSeconds;

        $cached = [];
        $hasTypingTable = $this->typingTableExists();
        if (! $hasTypingTable) {
            return $cached;
        }

        $threshold = date('Y-m-d H:i:s', time() - $timeoutSeconds);
        $db = \Config\Database::connect();

        try {
            // Only need currently-typing rows.
            // Assumes `typing_indicators.updated_at` is refreshed when "typing" is set.
            $rows = $db->table('typing_indicators')
                ->select('from_user_id')
                ->where('to_user_id', $toUserId)
                ->where('is_typing', 1)
                ->where('updated_at >=', $threshold)
                ->get()
                ->getResultArray();
---
SELECT `from_user_id`
FROM `typing_indicators`
WHERE `to_user_id` = 6
AND `is_typing` = 1
AND `updated_at` >= '2026-04-02 05:37:20'