app/Controllers/Notifications.php

    public function count(): ResponseInterface
    {
        $userId = (int) session()->get('user_id');
        if (! $userId) {
            return $this->response->setJSON(['count' => 0]);
        }
        $db    = \Config\Database::connect();
        $row   = $db->table('notifications')->where('user_id', $userId)->where('is_read', 0)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 6
AND `is_read` = 0