app/Models/MessageModel.php

    public function getConversation(int $userId, int $otherUserId, int $limit = 100): array
    {
        $hiddenIds = $this->getHiddenMessageIdsForUser($userId);
        $builder = $this->withDeleted()->groupStart()
            ->groupStart()
                ->where('sender_id', $userId)->where('receiver_id', $otherUserId)
            ->groupEnd()
            ->orGroupStart()
                ->where('sender_id', $otherUserId)->where('receiver_id', $userId)
            ->groupEnd()
        ->groupEnd();
        if ($hiddenIds !== []) {
            $builder->whereNotIn('id', $hiddenIds);
        }
        return $builder->orderBy('created_at', 'ASC')->findAll($limit);
---
SELECT *
FROM `messages`
WHERE   (
   (
`sender_id` = 6
AND `receiver_id` = 2
  )
OR    (
`sender_id` = 2
AND `receiver_id` = 6
  )
 )
ORDER BY `created_at` ASC
 LIMIT 100

    public function getHiddenMessageIdsForUser(int $userId): array
    {
        $db = $this->db;
        $result = $db->table('message_hides')->select('message_id')->where('user_id', $userId)->get()->getResultArray();
---
SELECT `message_id`
FROM `message_hides`
WHERE `user_id` = 6

    public function getConversationPartnerIds(int $userId): array
    {
        $builder = $this->builder();
        $builder->select('sender_id, receiver_id');
        $builder->groupStart();
        $builder->where('sender_id', $userId);
        $builder->orWhere('receiver_id', $userId);
        $builder->groupEnd();
        $rows = $builder->get()->getResultArray();
---
SELECT `sender_id`, `receiver_id`
FROM `messages`
WHERE   (
`sender_id` = 6
OR `receiver_id` = 6
 )